/**
  **********************************************************************************************************************
  * @file    param_cfg.h
  * @brief   该文件提供参数管理框架相关配置选项
  * @author  const_zpc    any question please send mail to const_zpc@163.com
  * @date    2023-03-11
  **********************************************************************************************************************
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef _PARAM_CFG_H_
#define _PARAM_CFG_H_

/* Includes ----------------------------------------------------------------------------------------------------------*/

/** 反序列化完整信息的解析单次得到最大参数表元素数目设置 */
#define PARAM_PARSE_MAX_NUM        10


/** 字符串参数长度需要使用的字节(1：最长可定义254长度的字符串参数, 2：最长可定义63335长度的字符串参数) */
#define PARAM_STRING_SIZE           1

/** 参数名字最大定义长度（包括结束符） */
#define PARAM_NAME_MAX_LENGTH       32


#endif
